from app_logger import logger
import traceback

example_json = {
    "BasicReport": {
        "Info": {
            "kpp": "312301001",
            "okpo": "83588841",
            "okato": "14401370000",
            "okfs": "16",
            "oktmo": "14701000001",
            "okogu": "4210014",
            "okopf": "12300",
            "opf": "Общества с ограниченной ответственностью",
            "legalName": {
                "short": "ООО \"ТД Агро-Белогорье\"",
                "full": "Общество с ограниченной ответственностью \"Торговый Дом \"Агро-Белогорье\"",
                "readable": "ООО \"Торговый Дом \"Агро-Белогорье\"",
                "date": "2007-12-14"
            },
            "legalAddress": {
                "parsedAddressRF": {
                    "zipCode": "308012",
                    "kladrCode": "310000010000141",
                    "regionCode": "31",
                    "regionName": {
                        "topoShortName": "обл",
                        "topoFullName": "область",
                        "topoValue": "Белгородская"
                    },
                    "city": {
                        "topoShortName": "г",
                        "topoFullName": "город",
                        "topoValue": "Белгород"
                    },
                    "street": {
                        "topoShortName": "ул",
                        "topoFullName": "улица",
                        "topoValue": "Костюкова"
                    },
                    "house": {
                        "topoShortName": "дом",
                        "topoFullName": "дом",
                        "topoValue": "34Б"
                    },
                    "flat": {
                        "topoShortName": "каб",
                        "topoFullName": "кабинет",
                        "topoValue": "1"
                    },
                    "houseRaw": "Д. 34Б",
                    "flatRaw": "КАБИНЕТ 1"
                },
                "date": "2018-09-14",
                "firstDate": "2018-09-14"
            },
            "status": {
                "statusString": "Действующее"
            },
            "registrationDate": "2007-12-14",
            "heads": [
                {
                    "fio": "Дмитрова Олеся Юрьевна",
                    "innfl": "312302064873",
                    "position": "Генеральный Директор",
                    "date": "2013-03-20",
                    "firstDate": "2009-06-15",
                    "structuredFio": {
                        "firstName": "Олеся",
                        "lastName": "Дмитрова",
                        "middleName": "Юрьевна"
                    }
                }
            ],
            "history": {
                "kpps": [
                    {
                        "kpp": "312101001",
                        "date": "2012-04-10"
                    }
                ],
                "legalAddresses": [
                    {
                        "parsedAddressRF": {
                            "zipCode": "309061",
                            "kladrCode": "310210000340001",
                            "regionCode": "31",
                            "regionName": {
                                "topoShortName": "обл",
                                "topoFullName": "область",
                                "topoValue": "Белгородская"
                            },
                            "district": {
                                "topoShortName": "р-н",
                                "topoFullName": "район",
                                "topoValue": "Яковлевский"
                            },
                            "settlement": {
                                "topoShortName": "х",
                                "topoFullName": "хутор",
                                "topoValue": "Крапивенские Дворы"
                            },
                            "street": {
                                "topoShortName": "ул",
                                "topoFullName": "улица",
                                "topoValue": "Магистральная"
                            },
                            "house": {
                                "topoShortName": "дом",
                                "topoFullName": "дом",
                                "topoValue": "109"
                            },
                            "houseRaw": "ДОМ 109"
                        },
                        "date": "2017-08-25",
                        "firstDate": "2017-08-25"
                    },
                    {
                        "parsedAddressRF": {
                            "zipCode": "309061",
                            "kladrCode": "31021000034",
                            "regionCode": "31",
                            "regionName": {
                                "topoShortName": "обл",
                                "topoFullName": "область",
                                "topoValue": "Белгородская"
                            },
                            "district": {
                                "topoShortName": "р-н",
                                "topoFullName": "район",
                                "topoValue": "Яковлевский"
                            },
                            "settlement": {
                                "topoShortName": "х",
                                "topoFullName": "хутор",
                                "topoValue": "Крапивенские Дворы"
                            },
                            "house": {
                                "topoValue": "в границах СПК \"1-Мая\" Северо-Восточнее Х. Крапиве"
                            },
                            "houseRaw": "В ГРАНИЦАХ СПК \"1-МАЯ\" СЕВЕРО-ВОСТОЧНЕЕ Х. КРАПИВЕ"
                        },
                        "date": "2012-03-23",
                        "firstDate": "2012-03-23"
                    },
                    {
                        "parsedAddressRF": {
                            "zipCode": "308000",
                            "regionCode": "31",
                            "regionName": {
                                "topoShortName": "обл",
                                "topoFullName": "область",
                                "topoValue": "Белгородская"
                            },
                            "city": {
                                "topoShortName": "г",
                                "topoFullName": "город",
                                "topoValue": "Белгород"
                            },
                            "street": {
                                "topoShortName": "ул",
                                "topoFullName": "улица",
                                "topoValue": "Щорса"
                            },
                            "house": {
                                "topoShortName": "дом",
                                "topoFullName": "дом",
                                "topoValue": "8"
                            },
                            "houseRaw": "8",
                            "bulkRaw": "0",
                            "flatRaw": "0"
                        },
                        "date": "2007-12-14",
                        "firstDate": "2007-12-14"
                    }
                ]
            }
        },
        "Phones": [
            "84722586677",
            "84722586692",
            "84722586900",
            "84722586690",
            "84712528182",
            "84722586680",
            "84732606793",
            "88002345646",
            "88002502725",
            "88314561311",
            "88314561380",
            "88612323909",
            "89805216347",
            "89805216354"
        ],
        "Sites": [
            "tdab.ru",
            "tdab.shop",
            "etp.etpagro.ru"
        ],
        "INN": "3123169789",
        "OGRN": "1073123028703"
    },
    "ExtendedReport_1": {
        "inn": "3123169789",
        "ogrn": "1073123028703",
        "focusHref": "https://focus.kontur.ru/entity?query=1073123028703",
        "UL": {
            "okpo": "83588841",
            "pfrRegNumber": "041001159316",
            "fssRegNumber": "310121180031001",
            "fomsRegNumber": "144010700171062",
            "activities": {
                "principalActivity": {
                    "code": "46.32",
                    "text": "Торговля оптовая мясом и мясными продуктами",
                    "date": "2013-11-18"
                },
                "complementaryActivities": [
                    {
                        "code": "10.11",
                        "text": "Переработка и консервирование мяса",
                        "date": "2007-12-14"
                    },
                    {
                        "code": "16.24",
                        "text": "Производство деревянной тары",
                        "date": "2016-12-29"
                    },
                    {
                        "code": "33.19",
                        "text": "Ремонт прочего оборудования",
                        "date": "2016-12-29"
                    },
                    {
                        "code": "45.1",
                        "text": "Торговля автотранспортными средствами",
                        "date": "2007-12-14"
                    },
                    {
                        "code": "46.2",
                        "text": "Торговля оптовая сельскохозяйственным сырьем и живыми животными",
                        "date": "2007-12-14"
                    },
                    {
                        "code": "46.23",
                        "text": "Торговля оптовая живыми животными",
                        "date": "2013-11-18"
                    },
                    {
                        "code": "46.31",
                        "text": "Торговля оптовая фруктами и овощами",
                        "date": "2017-11-01"
                    },
                    {
                        "code": "46.32.1",
                        "text": "Торговля оптовая мясом и мясом птицы, включая субпродукты",
                        "date": "2013-11-18"
                    },
                    {
                        "code": "46.32.3",
                        "text": "Торговля оптовая консервами из мяса и мяса птицы",
                        "date": "2013-11-18"
                    },
                    {
                        "code": "46.33.1",
                        "text": "Торговля оптовая молочными продуктами",
                        "date": "2013-11-18"
                    },
                    {
                        "code": "46.46",
                        "text": "Торговля оптовая фармацевтической продукцией",
                        "date": "2021-12-28"
                    },
                    {
                        "code": "46.46.1",
                        "text": "Торговля оптовая фармацевтической продукцией",
                        "date": "2021-12-28"
                    },
                    {
                        "code": "47.21",
                        "text": "Торговля розничная фруктами и овощами в специализированных магазинах",
                        "date": "2017-11-01"
                    },
                    {
                        "code": "47.22.2",
                        "text": "Торговля розничная продуктами из мяса и мяса птицы в специализированных магазинах",
                        "date": "2007-12-14"
                    },
                    {
                        "code": "47.29",
                        "text": "Торговля розничная прочими пищевыми продуктами в специализированных магазинах",
                        "date": "2007-12-14"
                    },
                    {
                        "code": "47.29.11",
                        "text": "Торговля розничная молочными продуктами в специализированных магазинах",
                        "date": "2013-11-18"
                    },
                    {
                        "code": "47.8",
                        "text": "Торговля розничная в нестационарных торговых объектах и на рынках",
                        "date": "2007-12-14"
                    },
                    {
                        "code": "56.10",
                        "text": "Деятельность ресторанов и услуги по доставке продуктов питания",
                        "date": "2007-12-14"
                    },
                    {
                        "code": "56.10.1",
                        "text": "Деятельность ресторанов и кафе с полным ресторанным обслуживанием, кафетериев, ресторанов быстрого питания и самообслуживания",
                        "date": "2007-12-14"
                    },
                    {
                        "code": "56.10.3",
                        "text": "Деятельность ресторанов и баров по обеспечению питанием в железнодорожных вагонах-ресторанах и на судах",
                        "date": "2007-12-14"
                    },
                    {
                        "code": "68.10.23",
                        "text": "Покупка и продажа земельных участков",
                        "date": "2007-12-14"
                    },
                    {
                        "code": "68.3",
                        "text": "Операции с недвижимым имуществом за вознаграждение или на договорной основе",
                        "date": "2007-12-14"
                    },
                    {
                        "code": "70.22",
                        "text": "Консультирование по вопросам коммерческой деятельности и управления",
                        "date": "2007-12-14"
                    },
                    {
                        "code": "77.39",
                        "text": "Аренда и лизинг прочих видов транспорта, оборудования и материальных средств, не включенных в другие группировки",
                        "date": "2016-12-29"
                    }
                ],
                "okvedVersion": "2"
            },
            "regInfo": {
                "ogrnDate": "2007-12-14"
            },
            "nalogRegBody": {
                "nalogCode": "3100",
                "nalogName": "Управление Федеральной налоговой службы по Белгородской области",
                "nalogRegDate": "2022-04-25",
                "kpp": "312301001",
                "date": "2022-04-25"
            },
            "regBody": {
                "nalogCode": "3100",
                "nalogName": "Управление Федеральной налоговой службы по Белгородской области",
                "nalogRegAddress": "308000, Белгород г, Преображенская ул, д 61",
                "date": "2022-04-21"
            },
            "statedCapital": {
                "sum": 10000,
                "date": "2007-12-14"
            },
            "foundersUL": [
                {
                    "ogrn": "1073123019970",
                    "inn": "3123160948",
                    "fullName": "Общество с ограниченной ответственностью \"ГК Агро-Белогорье\"",
                    "share": {
                        "sum": 10000,
                        "percentagePlain": 100
                    },
                    "date": "2009-12-24",
                    "firstDate": "2009-12-24"
                }
            ],
            "egrRecords": [
                {
                    "grn": "2223101196350",
                    "date": "2022-04-25",
                    "name": "Внесение сведений об учете в налоговом органе",
                    "regName": "Управление Федеральной Налоговой Службы по Белгородской Области",
                    "regCode": "3100"
                },
                {
                    "grn": "2223100124993",
                    "date": "2022-04-21",
                    "name": "Внесение сведений о предоставлении лицензии",
                    "regName": "Инспекция Федеральной Налоговой Службы по г. Белгороду",
                    "regCode": "3123"
                },
                {
                    "grn": "2213100402150",
                    "date": "2021-12-28",
                    "name": "Изменение сведений о ЮЛ, содержащихся в ЕГРЮЛ",
                    "regName": "Инспекция Федеральной Налоговой Службы по г. Белгороду",
                    "regCode": "3123",
                    "documents": [
                        {
                            "name": "Р13014 Заявление об изменении учр.документа и/или иных сведений о ЮЛ"
                        }
                    ]
                },
                {
                    "grn": "2183123952834",
                    "date": "2018-11-28",
                    "name": "Внесение сведений о регистрации в ПФР",
                    "regName": "Инспекция Федеральной Налоговой Службы по г. Белгороду",
                    "regCode": "3123"
                },
                {
                    "grn": "2183123836311",
                    "date": "2018-09-20",
                    "name": "Внесение сведений о регистрации в ПФР",
                    "regName": "Инспекция Федеральной Налоговой Службы по г. Белгороду",
                    "regCode": "3123"
                },
                {
                    "grn": "2183123836256",
                    "date": "2018-09-20",
                    "name": "Внесение сведений о регистрации в ПФР",
                    "regName": "Инспекция Федеральной Налоговой Службы по г. Белгороду",
                    "regCode": "3123"
                },
                {
                    "grn": "2183123826103",
                    "date": "2018-09-14",
                    "name": "Внесение сведений об учете в налоговом органе",
                    "regName": "Инспекция Федеральной Налоговой Службы по г. Белгороду",
                    "regCode": "3123"
                },
                {
                    "grn": "2183123826092",
                    "date": "2018-09-14",
                    "name": "Внесение сведений об учете в налоговом органе",
                    "regName": "Инспекция Федеральной Налоговой Службы по г. Белгороду",
                    "regCode": "3123"
                },
                {
                    "grn": "2183123825861",
                    "date": "2018-09-14",
                    "name": "Государственная регистрация изменений, внесенных в учредительный документ юридического лица, и внесение изменений в сведения о юридическом лице, содержащиеся в ЕГРЮЛ",
                    "regName": "Инспекция Федеральной Налоговой Службы по г. Белгороду",
                    "regCode": "3123",
                    "documents": [
                        {
                            "name": "Р13001 заявление об изменениях, вносимых в учред.документы"
                        },
                        {
                            "name": "Договор аренды"
                        },
                        {
                            "name": "Документ об оплате государственной пошлины",
                            "date": "2018-09-07"
                        },
                        {
                            "name": "Доверенность"
                        },
                        {
                            "name": "Решение о внесении изменений в учредительные документы",
                            "date": "2018-09-07"
                        },
                        {
                            "name": "Устав ЮЛ в новой редакции"
                        }
                    ]
                },
                {
                    "grn": "2183123781157",
                    "date": "2018-08-15",
                    "name": "Изменение сведений о ЮЛ, содержащихся в ЕГРЮЛ",
                    "regName": "Инспекция Федеральной Налоговой Службы по г. Белгороду",
                    "regCode": "3123",
                    "documents": [
                        {
                            "name": "Р14001 заявление об изм.сведений, не связанных с изм. учред.документов (п.2.1)"
                        },
                        {
                            "name": "Решение"
                        },
                        {
                            "name": "Доверенность на ботвину ю. с."
                        }
                    ]
                },
                {
                    "grn": "2183123369471",
                    "date": "2018-01-31",
                    "name": "Внесение сведений о регистрации в ФСС",
                    "regName": "Инспекция Федеральной Налоговой Службы по г. Белгороду",
                    "regCode": "3123"
                },
                {
                    "grn": "2173123486480",
                    "date": "2017-11-01",
                    "name": "Изменение сведений о ЮЛ, содержащихся в ЕГРЮЛ",
                    "regName": "Инспекция Федеральной Налоговой Службы по г. Белгороду",
                    "regCode": "3123",
                    "documents": [
                        {
                            "name": "Р14001 заявление об изм.сведений, не связанных с изм. учред.документов (п.2.1)"
                        },
                        {
                            "name": "Доверенность"
                        }
                    ]
                },
                {
                    "grn": "2173123379141",
                    "date": "2017-08-25",
                    "name": "Государственная регистрация изменений, внесенных в учредительный документ юридического лица, и внесение изменений в сведения о юридическом лице, содержащиеся в ЕГРЮЛ",
                    "regName": "Инспекция Федеральной Налоговой Службы по г. Белгороду",
                    "regCode": "3123",
                    "documents": [
                        {
                            "name": "Р13001 заявление об изменениях, вносимых в учред.документы"
                        },
                        {
                            "name": "Документ об оплате государственной пошлины",
                            "date": "2017-08-21"
                        },
                        {
                            "name": "Решение о внесении изменений в учредительные документы"
                        },
                        {
                            "name": "Устав ЮЛ в новой редакции"
                        },
                        {
                            "name": "Доверенность горбунову максиму андреевичу"
                        }
                    ]
                },
                {
                    "grn": "2163123769378",
                    "date": "2016-12-29",
                    "name": "Изменение сведений о ЮЛ, содержащихся в ЕГРЮЛ",
                    "regName": "Инспекция Федеральной Налоговой Службы по г. Белгороду",
                    "regCode": "3123",
                    "documents": [
                        {
                            "name": "Р14001 заявление об изм.сведений, не связанных с изм. учред.документов (п.2.1)"
                        },
                        {
                            "name": "Доверенность"
                        }
                    ]
                },
                {
                    "grn": "2163123682225",
                    "date": "2016-11-19",
                    "name": "Внесение сведений о регистрации в ПФР",
                    "regName": "Инспекция Федеральной Налоговой Службы по г. Белгороду",
                    "regCode": "3123"
                },
                {
                    "grn": "2133130031978",
                    "date": "2013-11-18",
                    "name": "Изменение сведений о ЮЛ, содержащихся в ЕГРЮЛ",
                    "regName": "Межрайонная Инспекция Федеральной Налоговой Службы №2 по Белгородской Области",
                    "regCode": "3130",
                    "documents": [
                        {
                            "name": "Заявление о внесении в единый государственный реестр юридических лиц изменений в сведения о юридическом лице, не связанных с внесением изменений в учредительные документы",
                            "date": "2013-11-11"
                        },
                        {
                            "name": "Доверенность на горбунова м.а.",
                            "date": "2013-08-23"
                        }
                    ]
                },
                {
                    "grn": "2133130010330",
                    "date": "2013-03-20",
                    "name": "Изменение сведений о ЮЛ, содержащихся в ЕГРЮЛ",
                    "regName": "Межрайонная Инспекция Федеральной Налоговой Службы №2 по Белгородской Области",
                    "regCode": "3130",
                    "documents": [
                        {
                            "name": "Заявление о внесении в единый государственный реестр юридических лиц изменений в сведения о юридическом лице, не связанных с внесением изменений в учредительные документы",
                            "date": "2013-03-13"
                        }
                    ],
                    "certificates": [
                        {
                            "serialNumber": "31 002395168",
                            "date": "2013-03-20"
                        }
                    ]
                },
                {
                    "grn": "2123130030835",
                    "date": "2012-10-27",
                    "name": "Внесение сведений о регистрации в ПФР",
                    "regName": "Межрайонная Инспекция Федеральной Налоговой Службы №2 по Белгородской Области",
                    "regCode": "3130"
                },
                {
                    "grn": "2123130029560",
                    "date": "2012-10-27",
                    "name": "Внесение сведений о регистрации в ПФР",
                    "regName": "Межрайонная Инспекция Федеральной Налоговой Службы №2 по Белгородской Области",
                    "regCode": "3130"
                },
                {
                    "grn": "2123130013829",
                    "date": "2012-05-18",
                    "name": "Внесение сведений о регистрации в ФСС",
                    "regName": "Межрайонная Инспекция Федеральной Налоговой Службы №2 по Белгородской Области",
                    "regCode": "3130"
                },
                {
                    "grn": "2123130013785",
                    "date": "2012-05-18",
                    "name": "Внесение сведений о регистрации в ФСС",
                    "regName": "Межрайонная Инспекция Федеральной Налоговой Службы №2 по Белгородской Области",
                    "regCode": "3130"
                },
                {
                    "grn": "2123130012025",
                    "date": "2012-04-20",
                    "name": "Внесение сведений о регистрации в ФСС",
                    "regName": "Межрайонная Инспекция Федеральной Налоговой Службы №2 по Белгородской Области",
                    "regCode": "3130"
                },
                {
                    "grn": "2123130010287",
                    "date": "2012-04-10",
                    "name": "Внесение сведений об учете в налоговом органе",
                    "regName": "Межрайонная Инспекция Федеральной Налоговой Службы №2 по Белгородской Области",
                    "regCode": "3130"
                },
                {
                    "grn": "2123123059948",
                    "date": "2012-03-23",
                    "name": "Внесение сведений об учете в налоговом органе",
                    "regName": "Инспекция Федеральной Налоговой Службы по г. Белгороду",
                    "regCode": "3123"
                },
                {
                    "grn": "2123123059937",
                    "date": "2012-03-23",
                    "name": "Государственная регистрация изменений, внесенных в учредительный документ юридического лица, и внесение изменений в сведения о юридическом лице, содержащиеся в ЕГРЮЛ",
                    "regName": "Инспекция Федеральной Налоговой Службы по г. Белгороду",
                    "regCode": "3123",
                    "documents": [
                        {
                            "name": "Заявление о государственной регистрации изменений, вносимых в учредительные документы юридического лица",
                            "date": "2012-03-16"
                        },
                        {
                            "name": "Решение о внесении изменений в учредительные документы",
                            "date": "2012-03-15"
                        },
                        {
                            "name": "Устав",
                            "date": "2012-03-15"
                        },
                        {
                            "name": "Документ об уплате государственной пошлины",
                            "date": "2012-03-16"
                        }
                    ],
                    "certificates": [
                        {
                            "serialNumber": "31 002290858",
                            "date": "2012-03-23"
                        }
                    ]
                },
                {
                    "grn": "2103123262636",
                    "date": "2010-08-16",
                    "name": "Государственная регистрация изменений, внесенных в учредительный документ юридического лица, и внесение изменений в сведения о юридическом лице, содержащиеся в ЕГРЮЛ",
                    "regName": "Инспекция Федеральной Налоговой Службы по г. Белгороду",
                    "regCode": "3123",
                    "documents": [
                        {
                            "name": "Заявление о государственной регистрации изменений, вносимых в учредительные документы юридического лица",
                            "date": "2010-08-09"
                        },
                        {
                            "name": "Решение о внесении изменений в учредительные документы",
                            "date": "2010-08-06"
                        },
                        {
                            "name": "Устав",
                            "date": "2010-08-06"
                        },
                        {
                            "name": "Документ об уплате государственной пошлины",
                            "date": "2010-08-05"
                        }
                    ],
                    "certificates": [
                        {
                            "serialNumber": "31 002074705",
                            "date": "2010-08-16"
                        }
                    ]
                },
                {
                    "grn": "2103123156860",
                    "date": "2010-03-17",
                    "name": "Внесение сведений о регистрации в ПФР",
                    "regName": "Инспекция Федеральной Налоговой Службы по г. Белгороду",
                    "regCode": "3123"
                },
                {
                    "grn": "2093123317120",
                    "date": "2009-12-24",
                    "name": "Внесение сведений, связанных с приведением устава ООО в соответствие с ФЗ-312 от 30.12.2008",
                    "regName": "Инспекция Федеральной Налоговой Службы по г. Белгороду",
                    "regCode": "3123",
                    "documents": [
                        {
                            "name": "Заявление о государственной регистрации изменений, вносимых в учредительные документы юридического лица"
                        },
                        {
                            "name": "Решение о внесении изменений в учредительные документы",
                            "date": "2009-12-15"
                        },
                        {
                            "name": "Устав",
                            "date": "2009-12-15"
                        },
                        {
                            "name": "Документ об уплате государственной пошлины",
                            "date": "2009-12-15"
                        }
                    ],
                    "certificates": [
                        {
                            "serialNumber": "31 002010552",
                            "date": "2009-12-24"
                        }
                    ]
                },
                {
                    "grn": "2093123120320",
                    "date": "2009-07-03",
                    "name": "Государственная регистрация изменений, внесенных в учредительный документ юридического лица, и внесение изменений в сведения о юридическом лице, содержащиеся в ЕГРЮЛ",
                    "regName": "Инспекция Федеральной Налоговой Службы по г. Белгороду",
                    "regCode": "3123",
                    "documents": [
                        {
                            "name": "Заявление о государственной регистрации изменений, вносимых в учредительные документы юридического лица",
                            "date": "2009-06-26"
                        },
                        {
                            "name": "Устав",
                            "date": "2009-06-25"
                        },
                        {
                            "name": "Решение о внесении изменений в учредительные документы",
                            "date": "2009-06-25"
                        },
                        {
                            "name": "Документ об уплате государственной пошлины",
                            "date": "2009-06-24"
                        }
                    ],
                    "certificates": [
                        {
                            "serialNumber": "31 001931091",
                            "date": "2009-07-03"
                        }
                    ]
                },
                {
                    "grn": "2093123120319",
                    "date": "2009-07-03",
                    "name": "Изменение сведений о ЮЛ, содержащихся в ЕГРЮЛ",
                    "regName": "Инспекция Федеральной Налоговой Службы по г. Белгороду",
                    "regCode": "3123",
                    "documents": [
                        {
                            "name": "Заявление о внесении в единый государственный реестр юридических лиц изменений в сведения о юридическом лице, не связанных с внесением изменений в учредительные документы",
                            "date": "2009-06-26"
                        }
                    ],
                    "certificates": [
                        {
                            "serialNumber": "31 001931090",
                            "date": "2009-07-03"
                        }
                    ]
                },
                {
                    "grn": "2093123110640",
                    "date": "2009-06-15",
                    "name": "Изменение сведений о ЮЛ, содержащихся в ЕГРЮЛ",
                    "regName": "Инспекция Федеральной Налоговой Службы по г. Белгороду",
                    "regCode": "3123",
                    "documents": [
                        {
                            "name": "Заявление о внесении в единый государственный реестр юридических лиц изменений в сведения о юридическом лице, не связанных с внесением изменений в учредительные документы",
                            "date": "2009-06-05"
                        }
                    ],
                    "certificates": [
                        {
                            "serialNumber": "31 001923583",
                            "date": "2009-06-15"
                        }
                    ]
                },
                {
                    "grn": "2093123101509",
                    "date": "2009-05-21",
                    "name": "Государственная регистрация изменений, внесенных в учредительный документ юридического лица, и внесение изменений в сведения о юридическом лице, содержащиеся в ЕГРЮЛ",
                    "regName": "Инспекция Федеральной Налоговой Службы по г. Белгороду",
                    "regCode": "3123",
                    "documents": [
                        {
                            "name": "Заявление о государственной регистрации изменений, вносимых в учредительные документы юридического лица",
                            "date": "2009-05-14"
                        },
                        {
                            "name": "Устав",
                            "date": "2009-05-13"
                        },
                        {
                            "name": "Решение о внесении изменений в учредительные документы",
                            "date": "2009-05-13"
                        },
                        {
                            "name": "Документ об уплате государственной пошлины",
                            "date": "2009-05-14"
                        }
                    ],
                    "certificates": [
                        {
                            "serialNumber": "31 001948876",
                            "date": "2009-05-21"
                        }
                    ]
                },
                {
                    "grn": "2073123252376",
                    "date": "2007-12-20",
                    "name": "Изменение сведений о ЮЛ, содержащихся в ЕГРЮЛ",
                    "regName": "Инспекция Федеральной Налоговой Службы по г. Белгороду",
                    "regCode": "3123",
                    "documents": [
                        {
                            "name": "Заявление о внесении в единый государственный реестр юридических лиц изменений в сведения о юридическом лице, не связанных с внесением изменений в учредительные документы",
                            "date": "2007-12-17"
                        }
                    ],
                    "certificates": [
                        {
                            "serialNumber": "31 001835954",
                            "date": "2007-12-20"
                        }
                    ]
                },
                {
                    "grn": "2073123251023",
                    "date": "2007-12-14",
                    "name": "Внесение сведений об учете в налоговом органе",
                    "regName": "Инспекция Федеральной Налоговой Службы по г. Белгороду",
                    "regCode": "3123"
                },
                {
                    "grn": "1073123028703",
                    "date": "2007-12-14",
                    "name": "Создание ЮЛ",
                    "regName": "Инспекция Федеральной Налоговой Службы по г. Белгороду",
                    "regCode": "3123",
                    "documents": [
                        {
                            "name": "Заявление о государственной регистрации юридического лица при создании",
                            "date": "2007-12-11"
                        },
                        {
                            "name": "Устав",
                            "date": "2007-12-10"
                        },
                        {
                            "name": "Решение о создании юридического лица",
                            "date": "2007-12-10"
                        },
                        {
                            "name": "Документ об уплате государственной пошлины",
                            "date": "2007-12-11"
                        }
                    ],
                    "certificates": [
                        {
                            "serialNumber": "31 001835846",
                            "date": "2007-12-14"
                        }
                    ]
                }
            ],
            "history": {}
        }
    },
    "ExtendedReport_2": {
        "inn": "3123169789",
        "ogrn": "1073123028703",
        "focusHref": "https://focus.kontur.ru/entity?query=1073123028703",
        "analytics": {
            "q2004": 4,
            "s2004": 957602.11,
            "q2023": 4,
            "s2023": 957602.11,
            "q2034": 1,
            "s2034": 722235.1,
            "q4003": 6,
            "s4003": 1000350.0,
            "q6001": 2021,
            "m6002": 'true',
            "s6003": 24858399000,
            "s6004": 30129252000,
            "s6005": 789038000,
            "s6006": 643036000,
            "s6007": 5087000,
            "s6008": 8908000,
            "s6009": 78189078.78,
            "s6010": 24864144000.0,
            "s6011": 24855575000.0,
            "d6014": 2021,
            "e6014": "CCC",
            "q7006": 1,
            "q7007": 4,
            "q7008": 1,
            "q7009": 13,
            "d7010": "2022-08-24",
            "q7018": 6,
            "q7019": 6,
            "q7020": 8,
            "q7021": 8,
            "q7022": 378,
            "q8001": 3,
            "q9001": 6
        }
    },
    "BasicPDFReport": "",
    "FinPDFReport": "",
    "BenefitiarsReport": {
        "Capital": {
            "sum": 10000,
            "date": "2007-12-14"
        },
        "Benefitiars": {
            "beneficialOwnersFL": [
                {
                    "fio": "Зотов Владимир Федорович",
                    "innfl": "312301767305",
                    "share": 72.5000023841858,
                    "isAccurate": 'true'
                },
                {
                    "fio": "Ковалева Лариса Владимировна",
                    "innfl": "312325657492",
                    "share": 5.00000007450581,
                    "isAccurate": 'true'
                },
                {
                    "fio": "Мошкович Вадим Николаевич",
                    "innfl": "773100682469",
                    "share": 0.00224999988355558,
                    "isAccurate": 'true'
                }
            ],
            "beneficialOwnersUL": [
                {
                    "ogrn": "1105003000937",
                    "inn": "5003077160",
                    "fullName": "ПАО «Группа «Русагро»",
                    "share": 22.4977490306497,
                    "isAccurate": 'true'
                }
            ],
            "beneficialOwnersForeign": [],
            "beneficialOwnersOther": []
        },
        "Benefitiars history": {
            "beneficialOwnersFL": [
                {
                    "fio": "Соловьев Александр Кириллович",
                    "innfl": "366201004605"
                },
                {
                    "fio": "Кириленко Сергей Анатольевич"
                },
                {
                    "fio": "Быковская Наталия Алексеевна",
                    "innfl": "772501548902"
                }
            ],
            "beneficialOwnersUL": [
                {
                    "ogrn": "1057748143420",
                    "inn": "7710598437",
                    "fullName": "ЗАО \"Инвест - Центр\""
                }
            ],
            "beneficialOwnersForeign": [
                {
                    "fullName": "Рос Агро Плс",
                    "country": "Кипр"
                }
            ],
            "beneficialOwnersOther": [
                {
                    "fullName": "Ros Agro Plc (Рос Агро Плс)"
                },
                {
                    "fullName": "Ros Agro Plc (Рос Агро пиэлси)"
                }
            ]
        }
    }
}


def json2pdf_converter(json_response):
    pass


def json_order_converter(json_response):
    result = {'Основные сведения': {}
             }
    result['Основные сведения']['ИНН'] = json_response.get('BasicReport').get('INN')
    result['Основные сведения']['ОГРН'] = json_response.get('BasicReport').get('OGRN')
    result['Основные сведения']['ОГРН'] = json_response.get('BasicReport').get('OGRN')
    print(result)


def myprint(d):
    for k, v in d.items():
        if isinstance(v, dict):
            myprint(v)
        elif isinstance(v, list):
            for list_item in v:
                if isinstance(list_item, dict):
                    myprint(list_item)
                else:
                    print(list_item)
        else:
            print(f'{k} - {v}')


def basic_report_converter(json_response):
    try:
        json_order_converter(json_response)
        #print(','.join(f'{k}:{v}' for k, v in json_response.items()))
        #myprint(json_response)
    except Exception as err:
        lf = '\n'
        logger.error(f'{traceback.format_exc().replace(lf, "")} : {str(err)}')


if __name__ == '__main__':
    basic_report_converter(example_json)
